In [62]:
import pandas
import numpy

In [63]:
data = pandas.read_csv("Domestic violence.csv")
df = pandas.DataFrame(data)
df

     SL. No  Age Education     Employment   Income Marital status  Violence
0         1   30  secondary     unemployed       0         married       yes
1         2   47   tertiary     unemployed       0         married        no
2         3   24   tertiary     unemployed       0        unmarred        no
3         4   22   tertiary     unemployed       0        unmarred        no
4         5   50    primary     unemployed       0         married       yes
..      ...  ...        ...            ...     ...             ...       ...
342     343   27   tertiary  semi employed   30000        unmarred        no
343     344   26   tertiary       employed   35000         married        no
344     345   27    primary     unemployed       0         married       yes
345     346   29    primary     unemployed       0         married        no
346     347   24  secondary     unemployed       0         married        no

[347 rows x 7 columns]

In [64]:
# target >>> violence
# imput features >>> remaining

In [65]:
df.isna().sum()

SL. No             0
Age                0
Education          0
Employment         0
Income             0
Marital status     0
Violence           0
dtype: int64

In [66]:
df.dtypes

SL. No              int64
Age                 int64
Education          object
Employment         object
Income              int64
Marital status     object
Violence           object
dtype: object

In [67]:
df = df.drop(columns=["SL. No","Age"],axis=0)
df

    Education     Employment   Income Marital status  Violence
0    secondary     unemployed       0         married       yes
1     tertiary     unemployed       0         married        no
2     tertiary     unemployed       0        unmarred        no
3     tertiary     unemployed       0        unmarred        no
4      primary     unemployed       0         married       yes
..         ...            ...     ...             ...       ...
342   tertiary  semi employed   30000        unmarred        no
343   tertiary       employed   35000         married        no
344    primary     unemployed       0         married       yes
345    primary     unemployed       0         married        no
346  secondary     unemployed       0         married        no

[347 rows x 5 columns]

In [68]:
df.isna().sum()

Education          0
Employment         0
Income             0
Marital status     0
Violence           0
dtype: int64

In [69]:
df.dtypes

Education          object
Employment         object
Income              int64
Marital status     object
Violence           object
dtype: object

In [70]:
from sklearn.preprocessing import LabelEncoder

le = LabelEncoder()
df['Education '] = le.fit_transform(df['Education '])
df['Employment '] = le.fit_transform(df['Employment '])
df['Martial status '] = le.fit_transform(df['Marital status '])
df['Violence '] = le.fit_transform(df['Violence '])
df

,Education,Employment,Income,Marital status,Violence,Martial status
0,2,3,0,married,1,0
1,3,3,0,married,0,0
2,3,3,0,unmarred,0,1
3,3,3,0,unmarred,0,1
4,1,3,0,married,1,0
...,...,...,...,...,...,...
342,3,2,30000,unmarred,0,1
343,3,0,35000,married,0,0
344,1,3,0,married,1,0
345,1,3,0,married,0,0
346,2,3,0,married,0,0

In [71]:
df.dtypes

Education           int64
Employment          int64
Income              int64
Marital status     object
Violence            int64
Martial status      int64
dtype: object

In [72]:
X = df.iloc[:,:-1]
Y = df.iloc[:,-1]
X

     Education   Employment   Income Marital status   Violence
0             2            3       0         married          1
1             3            3       0         married          0
2             3            3       0        unmarred          0
3             3            3       0        unmarred          0
4             1            3       0         married          1
..          ...          ...     ...             ...        ...
342           3            2   30000        unmarred          0
343           3            0   35000         married          0
344           1            3       0         married          1
345           1            3       0         married          0
346           2            3       0         married          0

[347 rows x 5 columns]

In [73]:
df.dtypes

Education           int64
Employment          int64
Income              int64
Marital status     object
Violence            int64
Martial status      int64
dtype: object